zfeifei90/arm-trusted-firmware/plat/st/stm32mp1/include/boot_api.h
/* TAMP_BCK0R register index */
#define \
BOOT_API_MCIC_MCU_SECURITY_PERIMETER_TZEN_MCKPROT_TAMP_BCK_REG_IDX	0

/*
 * TAMP_BCK1R register index
 * This register is coding the wanted value of register 'EXTI_TZENR1'
 * to be programmed by bootROM on wakeup from STANDBY when MCUBEN=1
 * that is MCU quick restart requested
 */
#define \
BOOT_API_MCIC_MCU_SECURITY_PERIMETER_EXTI_TZENR1_TAMP_BCK_REG_IDX	1

/*
 * TAMP_BCK2R register index
 * This register is coding the wanted value of register 'EXTI_TZENR2'
 * to be programmed by bootROM on wakeup from STANDBY when MCUBEN=1
 * that is MCU quick restart requested
 */
#define \
BOOT_API_MCIC_MCU_SECURITY_PERIMETER_EXTI_TZENR2_TAMP_BCK_REG_IDX	2

/*
 * TAMP_BCK3R register index
 * This register is coding the wanted value of register 'EXTI_TZENR3'
 * to be programmed by bootROM on wakeup from STANDBY when MCUBEN=1
 * that is MCU quick restart requested
 */
#define \
BOOT_API_MCIC_MCU_SECURITY_PERIMETER_EXTI_TZENR3_TAMP_BCK_REG_IDX	3

/*
 * TAMP_BCK4R register index
 * This register is used to write a Magic Number in order to restart
 * Cortex A7 Core 1 and make it execute @ branch address from TAMP_BCK5R
 */
#define BOOT_API_CORE1_MAGIC_NUMBER_TAMP_BCK_REG_IDX		4U

/*
 * TAMP_BCK5R register index
 * This register is used to contain the branch address of
 * Cortex A7 Core 1 when restarted by a TAMP_BCK4R magic number writing
 */
#define BOOT_API_CORE1_BRANCH_ADDRESS_TAMP_BCK_REG_IDX		5U

/*
 * TAMP_BCK22R register index
 * This register contains offset in bytes of code to Hash in RETRAM region
 * Note : offset is intended as relative value from start of RETRAM
 */
#define \
BOOT_API_MCIC_OFFSET_IN_BYTES_CODE_TO_HASH_RETRAM_TAMP_BCK_REG_IDX	22

/*
 * TAMP_BCK23R register index
 * This register contains the size in bytes of the single consecutive region
 * of MCU Firmware in RETRAM (Retention RAM) to hash (by SHA-256)
 * Note : This is required as a MCU firmware Code Integrity Check (aka : MCIC)
 * to avoid bootROM restarting MCU on a corrupted firmware
 */
#define \
BOOT_API_MCIC_RETRAM_REGION_TO_HASH_IN_BYTES_TAMP_BCK_REG_IDX		23

/*
 * TAMP_BCK24R to TAMP_BCK31R register indexes
 * Those registers contains SHA-256 digest of RETRAM MCU Firmware code between
 * [(RETRAM_start + offset) -- (RETRAM_start + offset + size_to_hash)]
 * in this order
 * This is the MCU Code Integrity Check MCU Firmware signature
 * value on 256 bits
 */

/* First TAMP_BKP index of MCU Firmware signature : ie TAMP_BCK24R */
#define BOOT_API_MCIC_SHA_DIGEST_FIRST_TAMP_BCK_REG_IDX			24

/* Last TAMP_BKP index of MCU Firmware signature : ie TAMP_BCK31R */
#define BOOT_API_MCIC_SHA_DIGEST_LAST_TAMP_BCK_REG_IDX			31

/*
 * Possible value of boot context field 'hse_clock_value_in_hz'
 */
#define BOOT_API_CTX_HSE_CLOCK_VALUE_UNDEFINED			0U
#define BOOT_API_CTX_HSE_CLOCK_VALUE_24_MHZ			24000000U
#define BOOT_API_CTX_HSE_CLOCK_VALUE_25_MHZ			25000000U
#define BOOT_API_CTX_HSE_CLOCK_VALUE_26_MHZ			26000000U

/*
 * Possible value of boot context field 'boot_partition_used_toboot'
 */
#define BOOT_API_CTX_BOOT_PARTITION_UNDEFINED			0U

/* Used FSBL1 to boot */
#define BOOT_API_CTX_BOOT_PARTITION_FSBL1			1U

/* Used FSBL2 to boot */
#define BOOT_API_CTX_BOOT_PARTITION_FSBL2			2U

/* OTP_CFG0 */
#define BOOT_API_OTP_MODE_WORD_NB				0
/* Closed = OTP_CFG0[6] */
#define BOOT_API_OTP_MODE_CLOSED_BIT_POS			6

#define BOOT_API_RETURN_OK					0x77U

/* Mapping of OTP Word and OTP bits managing SSP and useful to FSBL-SSP */
#if STM32MP13
/* OTP_CFG9 */
#define BOOT_API_OTP_SSP_WORD_NB				9U
/* SSP_REQ = OTP_CFG9[5] */
#define BOOT_API_OTP_SSP_REQ_BIT_POS				5
/* SSP_SUCCESS = OTP_CFG9[6] */
#define BOOT_API_OTP_SSP_SUCCESS_BIT_POS			6
#endif
#if STM32MP15
/* OTP_CFG8 */
#define BOOT_API_OTP_SSP_WORD_NB				8U
/* SSP_REQ = OTP_CFG8[8] */
#define BOOT_API_OTP_SSP_REQ_BIT_POS				8
/* SSP_SUCCESS = OTP_CFG8[9] */
#define BOOT_API_OTP_SSP_SUCCESS_BIT_POS			9
#endif

/*
 * Possible values of boot context field
 * 'ssp_config_ptr_in->ssp_cmd'
 */
/* 'K' 'B' 'U' 'P' -.> 'PUBK' */
#define BOOT_API_CTX_SSP_CMD_CALC_CHIP_PUBK             0x4B425550

#if STM32MP_SSP
/* 'V' 'O' 'R' 'P' -.> 'PROV' */
#define BOOT_API_CTX_SSP_CMD_PROV_SECRET		0x564F5250
/*
 * Possible values of boot context field
 * 'ssp_config_ptr_in->ssp_cmd' written by bootROM as Acknowledge
 * of a request of SSP by FSBL.
 */

/* Written by bootROM on SSP error */
#define BOOT_API_CTX_SSP_CMD_INVALID			0x00000000
/*
 * 'A' 'B' 'U' 'P' -.> 'PUBA' : ACK of ECIES_CHIP_PUBK calculation
 * request by bootROM.
 */
#define BOOT_API_CTX_SSP_CMD_CALC_CHIP_PUBK_ACK		0x41425550
/*
 * 'A' 'O' 'R' 'P' -.> 'PROA' : ACK of OEM Secret Provisioning request
 * by bootROM.
 */
#define BOOT_API_CTX_SSP_CMD_PROV_SECRET_ACK		0x414F5250

/*
 * Constants required for SSP
 */
/* '.' 'P' 'S' 'S' -.> 'SSP.' */
#define BOOT_API_SSP_BLOB_LICENSE_TYPE_SSP_NORMAL	0x2E505353
/* 'L' 'P' 'S' 'S' -.> 'SSPL' */
#define BOOT_API_SSP_BLOB_LICENSE_TYPE_SSP_LIVE		0x4C505353
/* version 1 */
#define BOOT_API_SSP_LICENSE_LAYOUT_VERSION_TO_MATCH	0x00000001
/* 'P' 'P' 'S' 'S' -.> 'SSPP' */
#define BOOT_API_SSP_BLOB_PAYLOAD_MAGIC_SSP		0x50505353
/* IV AES on 128 bits = 16 bytes and KEY AES on 128 bits = 16 bytes */
#define BOOT_API_SSP_ENCRYPTED_IV_AND_KEY_SIZE_BYTES	32
/* version 1 */
#define BOOT_API_SSP_PAYLOAD_PROTOCOL_VERSION_TO_MATCH	0x00000001
/*
 * Scalar in Elliptic curve cryptography is an integer (often a Prime)
 * the number of bytes of this scalar is defined below.
 */
#define BOOT_API_SSP_SCALAR_SIZE_BYTES				32

/*
 * In Elliptic curve cryptography coordinates of points are 2D P
 * (Px, Py) as concatenation of two scalars.
 */
#define BOOT_API_SSP_EC_COORDINATE_SIZE_BYTES \
	(2 * BOOT_API_SSP_SCALAR_SIZE_BYTES)

/* In Elliptic curve cryptography Private Keys are scalars */
#define BOOT_API_SSP_PRIVK_KEY_SIZE_BYTES \
	BOOT_API_SSP_SCALAR_SIZE_BYTES

/*
 * In ECIES algorithm the Shared Secret (SS) is
 * the x coordinate (Px) of a point P(Px,Py) obtained on reference
 * chosen NIST-P256 Elliptic curve.
 */
#define BOOT_API_SSP_ECDH_SHARED_SECRET_SIZE_BYTES \
	BOOT_API_SSP_SCALAR_SIZE_BYTES

